---
kind: type
id: T:Autodesk.Revit.DB.RevolvedFace
source: html/4139e5bf-682d-e532-c04d-a937ed4191d2.htm
---
# Autodesk.Revit.DB.RevolvedFace

A revolved face of a 3d solid or open shell.

## Syntax (C#)
```csharp
public class RevolvedFace : Face
```

## Remarks
Revolved faces are defined by a profile curve and a local coordinate system.
For details on the parameterization, refer to the documentation for RevolvedSurface